app/controllers/forums/categories_controller.rb

INSERT INTO "forums_categories" ("created_at", "name", "updated_at") VALUES ('2010-08-24 21:57:45.563260', 'News and Rules', '2010-08-24 21:57:45.563260')
---
  def create
    @forums_category = Forums::Category.new(params[:forums_category])

    respond_to do |format|
      if @forums_category.save