app/controllers/forums/forums_controller.rb

  def create
    @forums_forum = Forums::Forum.new(params[:forums_forum])

    respond_to do |format|
      if @forums_forum.save
---
INSERT INTO "forums_forums" ("category_id", "created_at", "description", "name", "updated_at") VALUES (NULL, '2010-08-20 20:54:01.410087', 'Announcements about the forums.', 'Announcements', '2010-08-20 20:54:01.410087')

  def update
    @forums_forum = Forums::Forum.find(params[:id])

    respond_to do |format|
      if @forums_forum.update_attributes(params[:forums_forum])
---
UPDATE "forums_forums" SET "description" = 'Announcements about the forums and site.', "updated_at" = '2010-08-22 15:12:14.825072' WHERE ("forums_forums"."id" = 2)

  def destroy
    @forums_forum = Forums::Forum.find(params[:id])
    @forums_forum.destroy
---
DELETE FROM "forums_forums" WHERE ("forums_forums"."id" = 1)