app/controllers/forums/posts_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "forums_topics" SET "last_post_at" = '2010-08-24 15:33:47.094238', "last_poster_id" = 1, "updated_at" = '2010-08-24 15:33:47.099980' WHERE ("forums_topics"."id" = 37)
INSERT INTO "forums_posts" ("content", "created_at", "topic_id", "updated_at", "user_id") VALUES ('This is a reply', '2010-08-24 15:09:53.560070', NULL, '2010-08-24 15:09:53.560070', NULL)
---
  def create
    @forums_post = Forums::Post.new(params[:forums_post])
    @forums_post.user_id = current_user.id

    @forums_topic = Forums::Topic.find(@forums_post.topic_id)
    @forums_topic.update_attributes(:last_poster_id => current_user.id, :last_post_at => Time.now)

    respond_to do |format|
      if @forums_post.save

UPDATE "forums_posts" SET "content" = 'This is the edited post.', "updated_at" = '2010-08-24 15:29:31.339284' WHERE ("forums_posts"."id" = 35)
---
  def update
    @forums_post = Forums::Post.find(params[:id])

    respond_to do |format|
      if @forums_post.update_attributes(params[:forums_post])

DELETE FROM "forums_posts" WHERE ("forums_posts"."id" = 1)
---
  def destroy
    @forums_post = Forums::Post.find(params[:id])
    @forums_post.destroy