app/controllers/forums/topics_controller.rb

INSERT INTO "forums_topics" ("created_at", "forum_id", "last_post_at", "last_poster_id", "name", "updated_at", "user_id") VALUES ('2010-08-21 22:05:40.778073', NULL, '2010-08-21 22:05:40.777079', 1, '--- !map:ActiveSupport::HashWithIndifferentAccess
---
  def create
    # Add last post time and user name

    @forums_topic = Forums::Topic.new(params[:forums_topic])

    # Extra Params
    @forums_topic.last_post_at = Time.now
    @forums_topic.last_poster_id = current_user.id
    @forums_topic.user_id = current_user.id
    @forums_topic.post.user_id = current_user.id

    # Finallise the save.
    respond_to do |format|
      if @forums_topic.save

UPDATE "forums_topics" SET "name" = '1st Topic', "updated_at" = '2010-08-20 21:07:56.279487' WHERE ("forums_topics"."id" = 1)
---
  def update
    @forums_topic = Forums::Topic.find(params[:id])

    respond_to do |format|
      if @forums_topic.update_attributes(params[:forums_topic])

DELETE FROM "forums_topics" WHERE ("forums_topics"."id" = 1)
---
  def destroy
    @forums_topic = Forums::Topic.find(params[:id])
    @forums_topic.destroy