app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_hash", "password_salt", "updated_at", "username") VALUES ('2010-08-21 19:18:51.824327', 'david@nanashi.co.uk', 'ce27b08018fdffd5ea41c332302e7bd0710d39ba', 'b9d11ee37ecbdfda95c83f5180adcdb29202bd46', '2010-08-21 19:18:51.824327', 'admin')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
  	@users = User.find(params[:id])